{
  "Sterling Vermin": {
    "bludgeoning": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Smashed off balance! Roll damage as normal and the next attack against the creature has advantage.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Sent reeling! Do not roll your damage dice; instead, deal the maximum result possible with those dice and push the creature up to 15 feet in any direction.",
      "9-11": "Great hit! Roll your damage dice twice and add them together.",
      "12-13": "Take a seat! Roll damage dice twice and add them together and the creature is knocked prone.",
      "14-16": "Rocked and rolled! Roll damage dice twice and add them together, push the creature up to 15 feet away, and the creature is knocked prone.",
      "17-18": "Grievous injury! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add the result. Then roll on the Minor Injury chart. If the creature is wearing heavy armor roll on the Major Injury chart instead.",
      "19": "Crushed! Deal the twice maximum result of your damage dice and roll on the major injury chart.",
      "20": "Splat! Deal the maximum result of your damage dice twice, the creature is stunned until the end of your next turn, and roll on the major injury chart."
    },
    "magic:acid": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Scalding bile! Roll damage as normal and the creature is scarred. While scarred the creature has disadvantage on all Charisma ability checks except Charisma (Intimidation). Being scarred can be healed in the same way as a minor injury.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Melted flesh! Roll your damage as normal and the creature is disfigured. While disfigured the creature has disadvantage on all Charisma ability checks except Charisma (Intimidation). Being disfigured can be removed with the spell greater restoration.",
      "9-11": "Great hit! Roll your damage dice twice and add them together.",
      "12-13": "Boiling flesh! Roll twice as many damage dice as normal and if the creature is wearing armor its AC modifier is reduced by 1 until it can be repaired (for 1/4th the price of new armor of the same type) or cleaned (if the armor is magical). If the creature is not wearing armor, roll on the minor injury chart.",
      "14-16": "Horrific mutilation! Roll twice as many damage dice as normal and roll on the minor injury chart. Additionally, the creature is disfigured.  While disfigured the creature has disadvantage on all Charisma ability checks except Charisma (Intimidation). Being disfigured can be removed with the spell greater restoration.",
      "17-18": "Caustic trauma! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. If the creature is wearing armor, roll on the minor injury chart and its AC modifier is reduced by 2 until it can be repaired (for half the price of new armor of the same type) or cleaned (if the armor is magical). If the creature is not wearing armor, roll on the major injury chart.",
      "19": "Vitriolic! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Acid bath! Deal twice the maximum result of your damage dice. If the creature is wearing armor, the armor is destroyed (if non-magical) or rendered useless until cleaned during a long rest (if magical) and roll on the major injury chart.  If the creature is not wearing armor, roll on the major injury chart and the creature is disfigured.  While disfigured the creature has disadvantage on all Charisma ability checks except Charisma (Intimidation). Being disfigured can be removed with the spell greater restoration."
    },
    "magic:cold": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Chills! Roll damage as normal and the creature may only move half its movement speed on its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Frosty! Roll your damage as normal and the creature’s movement speed is 0 until the end of its next turn.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Freezing! Roll twice as many damage dice as normal and the creature is paralyzed until the end of its next turn.",
      "14-16": "Frozen! Roll twice as many damage dice as normal and the creature is paralyzed until the end of its next turn. If the creature takes damage before the end of its next turn, roll on the minor injury chart.",
      "17-18": "Ice block! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. The creature is paralyzed until the end of its next turn and rolls on the minor injury chart.",
      "19": "Glacial! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Subzero! Deal twice the maximum result of your damage dice, roll on the major injury chart, and the creature is paralyzed for the next minute. The creature may attempt a saving throw at the end of each of its turns (DC 16) to end this effect. If it fails this saving throw three times it is frozen solid and becomes a petrified but frozen solid in a block of ice rather than turned to stone."
    },
    "magic:fire": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Heat wave! Roll damage as normal and attack rolls for attacks that deal fire damage have advantage when made against the creature until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Hot flash! Roll your damage as normal and the creature is on fire. While the creature is on fire it takes 2d4 fire damage at the start of each of its turns. The creature can end this condition by dropping prone and using 5 feet of movement to roll on the ground.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Ablaze! Roll twice as many damage dice as normal and the creature is on fire. While the creature is on fire it takes 2d6 fire damage at the start of each of its turns. The creature can end this condition by dropping prone and using 5 feet of movement to roll on the ground.",
      "14-16": "Burnt to a crisp! Roll twice as many damage dice as normal and the creature is charred. If the creature has resistance to fire, it loses that resistance. If the creature does not have resistance to fire, it gains vulnerability to fire. Both of these effects can be ended the same as a minor injury.",
      "17-18": "Hellfire! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result then roll on the minor injury chart. Additionally, the creature is on fire. While the creature is on fire it takes 2d6 fire damage at the start of each of its turns. The creature can end this condition by dropping prone and using 5 feet of movement to roll on the ground.",
      "19": "Combustion! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Inferno! Deal twice the maximum result of your damage dice and roll on the major injury chart. Additionally, the creature is on fire. While the creature is on fire it takes 2d8 fire damage at the start of each of its turns. The creature can end this condition by dropping prone and using 5 feet of movement to roll on the ground."
    },
    "magic:force": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Spellstruck! Roll damage as normal and the creature has disadvantage on saving throws against spells until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Eldritch incandescence! Roll your damage as normal and spell attack rolls against the creature have advantage until the end of its next turn.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Bewitching blow! Roll twice as many damage dice as normal and the creature is spellbound until the end of its next turn. While spellbound it makes saving throws against spells with disadvantage and spell attack rolls against it have advantage.",
      "14-16": "Mystic magnet! Roll twice as many damage dice as normal and the creature is spellbound for the next minute. While spellbound it makes saving throws against spells with disadvantage and spell attack rolls against it have advantage. At the end of each of the creature’s turns it can make an Intelligence saving throw (DC 14) to end this effect.",
      "17-18": "Ensorcelled! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result then roll on the minor injury chart. Additionally, the creature is spellbound for the next minute. While spellbound it makes saving throws against spells with disadvantage and spell attack rolls against it have advantage. At the end of each of the creature’s turns it can make an Intelligence saving throw (DC 16) to end this effect.",
      "19": "Arcane injury! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Magically mauled! Deal twice the maximum result of your damage dice and roll on the major injury chart. Additionally, the creature is spellbound for the next minute. While spellbound it makes saving throws against spells with disadvantage and spell attack rolls against it have advantage. At the end of each of the creature’s turns it can make an Intelligence saving throw (DC 18) to end this effect."
    },
    "magic:lightning": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Shocking! Roll damage as normal and the creature cannot use reactions until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Sparks fly! Roll your damage as normal and you may choose one other creature within 15 ft. of the victim. That creature must succeed on a Dexterity saving throw (DC 14) or take half as much damage.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Electric arc! Roll twice as many damage dice as normal and you may choose one other creature within 15 ft. of the victim. That creature must succeed on a Dexterity saving throw (DC 18) or take half as much damage.",
      "14-16": "Fulminate! Roll twice as many damage dice as normal and roll on the minor injury chart. If the creature is wearing metal armor roll on the major injury chart instead.",
      "17-18": "Lit up! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. The creature and each creature you choose within 15 ft. of it cannot take reactions until the end of their next turn. Then roll on the minor injury chart.",
      "19": "Electrocuted! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Lightning rod! Deal twice the maximum result of your damage dice and you may choose one other creature within 15 ft. of the victim. That creature must succeed on a Dexterity saving throw (DC 20) or take half as much damage. Then roll on the major injury chart."
    },
    "magic:necrotic": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Spoil! Roll damage as normal and the creature cannot regain hit points until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Fester! Roll your damage as normal and the creature’s maximum hit points are reduced by the same amount.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Decay! Roll twice as many damage dice as normal and the creature’s maximum hit points are reduced by the same amount.",
      "14-16": "Rot! Roll twice as many damage dice as normal and the creature cannot regain hit points for the next minute. It may make a saving throw (DC 16) at the end of each of its turns to end this effect.",
      "17-18": "Blight! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. The creature’s maximum hit points are reduced by the same amount. Then roll on the minor injury chart.",
      "19": "Atrophy! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Putrefy! Deal twice the maximum result of your damage dice, the creature’s maximum hit points are reduced by the same amount, and the creature cannot regain hit points until the end of its next turn. Then roll on the major injury chart."
    },
    "magic:poison": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Nauseous! Roll damage as normal and the creature has disadvantage on its next ability check, attack roll, or saving throw.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Sickened! Roll your damage as normal and the creature has disadvantage on all ability checks, attack rolls, and saving throws until the end of its next turn.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Poisoned! Roll twice as many damage dice as normal and the creature is poisoned for the next minute. The creature may attempt a saving throw at the end of each of its turns (DC 12) to end this effect.",
      "14-16": "Contaminated! Roll twice as many damage dice as normal and the creature is poisoned for the next minute. The creature may attempt a saving throw at the end of each of its turns (DC 16) to end this effect.",
      "17-18": "Toxic shock! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. Then roll on the minor injury chart and the creature is poisoned for the next minute. The creature may attempt a saving throw at the end of each of its turns (DC 12) to end this effect.",
      "19": "System failure! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Biological breakdown! Deal twice the maximum result of your damage dice, roll on the major injury chart, and the creature is poisoned for the next minute. The creature may attempt a saving throw at the end of each of its turns (DC 16) to end this effect."
    },
    "magic:psychic": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Disoriented! Roll your damage dice as normal and you control the creature’s movement on its next turn.",
      "4-6": "Confused! Roll your damage dice as normal and the creature cannot differentiate friend from foe until the end of its next turn.",
      "7-8": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Dominated! Roll twice as many damage dice as normal and you control the creature’s action on its next turn.",
      "14-16": "Psychological fracture! Roll twice as many damage dice as normal and roll on the Insanity chart with disadvantage.",
      "17-18": "Psychological break! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. Then roll on the Insanity chart.",
      "19": "Madness! Deal twice the maximum result of your damage dice and roll on the Insanity chart.",
      "20": "Mind melt! Deal twice the maximum result of your damage dice and roll on the Insanity chart with advantage."
    },
    "magic:radiant": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Dazzled! Roll damage as normal and the creature cannot willingly move closer to you until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Disheartening blast! Roll your damage as normal and the creature is frightened until the end of its next turn.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Awed! Roll twice as many damage dice as normal and the creature is frightened until the end of its next turn.",
      "14-16": "Holy terror! Roll twice as many damage dice as normal and roll on the minor injury chart.  Additionally, the creature is frightened for the next minute. It can make a Wisdom saving throw (DC 16) at the end of each of its turns to end this effect.",
      "17-18": "Righteous mark! Deal the maximum amount of damage for your normal damage dice then roll your damage dice and add that result, then roll on the minor injury chart. Additionally, the creature glows for the next minute. While glowing it produces bright light up 10 feet and dim light up to 30 feet and all successful attacks against the creature deal an additional 1d4 radiant damage.",
      "19": "Wrath of the gods! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Smote! Deal twice the maximum result of your damage dice and roll on the major injury chart.  Additionally, the creature glows for the next minute. While glowing it produces bright light up 10 feet and dim light up to 30 feet and all successful attacks against the creature deal an additional 1d6 radiant damage."
    },
    "magic:thunder": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Boom! Roll damage as normal and the creature is deafened until the end of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Ka-boom! Roll your damage as normal and the creature is deafened for one minute.",
      "9-11": "Great hit! Roll twice as many damage dice as normal.",
      "12-13": "Thunder clap! Roll twice as many damage dice as normal and the creature is stunned until the start of its next turn and deafened for one minute.",
      "14-16": "Burst ear drums! Roll twice as many damage dice as normal and the creature is deafened permanently. Then roll on the minor injury chart.",
      "17-18": "Concussive blast! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add that result. The creature stunned until the end of its next turn and deafened permanently. Then roll on the minor injury chart.",
      "19": "Wall of sound! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Sonic salvo! Deal twice the maximum result of your damage dice, the creature is deafened permanently, and stunned until the end of its next round. Then roll on the major injury chart."
    },
    "piercing": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Lunge and thrust! Roll damage dice twice and use the higher result.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Stabbed! Roll your damage dice twice and add them together.",
      "9-11": "Great hit! Roll your damage dice twice and add them together.",
      "12-13": "Swiss cheese! Roll twice as many damage dice as normal. Then roll twice on the minor injury chart and use the lower result.",
      "14-16": "Punctured! Roll your damage dice twice and add them together and roll on the minor injury chart.",
      "17-18": "Cruel prick! Roll your damage dice twice and add them together and roll on the major injury chart.",
      "19": "Run through! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Pierce! Deal the maximum result of your damage dice twice, roll on the minor injury chart, and roll on the major injury chart."
    },
    "slashing": {
      "1": "You call that a crit? Roll damage as normal.",
      "2-3": "Sliced and diced! Roll damage as normal and the creature loses 1d6 hit points at the start of its next turn.",
      "4-6": "Good hit! Do not roll your damage dice, instead deal the maximum result possible with those dice.",
      "7-8": "Open gash! Roll your damage dice as normal and the creature is bleeding. For the next minute the creature loses 1d4 damage at the start of each of its turns until it uses an action to staunch this wound.",
      "9-11": "Great hit! Roll your damage dice twice and add them together.",
      "12-13": "Deep slice! Roll your damage dice twice and add them together and the creature is bleeding. For the next minute the creature loses 1d8 hit points at the start of each of its turns until it uses an action to staunch this wound.",
      "14-16": "Lacerated! Roll your damage dice twice and add them together and the creature is bleeding. For the next minute the creature loses 1d12 hit points at the start of each of its turns until it uses an action to staunch this wound.",
      "17-18": "Severed! Deal the maximum amount of damage from your normal damage dice then roll your damage dice and add the result. Then roll on the Minor Injury chart. If the creature is wearing light or no armor roll on the Major Injury chart instead.",
      "19": "Dissected! Deal twice the maximum result of your damage dice and roll on the major injury chart.",
      "20": "Slash! Deal the maximum result of your damage dice twice, roll on the major injury chart, and the creature is bleeding. For the next minute the creature loses 2d8 hit points at the start of each of its turns until it uses an action to staunch this wound."
    }
  },
  "Questionable Arcana": {
    "weapon": {
      "1": "You feel accomplished, but nothing remarkable happens. Effect: Regular critical hit.",
      "2-5": "You feel it is imperative to press the advantage no matter the cost. Effect: You can choose to gain advantage on all attacks against your target until the end of your next turn, but if you do all enemies have advantage on their attack rolls against you until the end of your next turn.",
      "6-9": "You feel it is imperative to press the advantage, but maintain awareness of your surroundings. Effect: You can choose to gain advantage on all attacks against your target next turn, your target has advantage on their attack rolls against you until the end of your next turn.",
      "10-14": "You know how to press the advantage. Effect: You gain advantage on all attacks against your target until the end of your next turn.",
      "15-19": "As you are fighting, you notice an effective route to escape danger. Effect: You are able to use the disengage action after your attack.",
      "20-24": "You feel the eb and flow of the battle, and know where to make your next move. Effect: After your turn you move to the top of the initiative order.",
      "25-29": "You begin to recognize patterns in your opponents fighting technique. Effect: You gain +2 to your AC against your target, and advantage on all savings throws from effects originating from your target until your next turn.",
      "30-39": "You are able to maneuver towards your opponent while attacking, and attempt to harass them. Effect: After your attack you can choose to attempt to grapple your opponent if you have a free hand, or attempt to shove your opponent if both hands are in use.",
      "40-49": "You are able to maneuver towards your opponent while attacking and harass them. Effect: After your attack you can choose to automatically succeed in grappling your opponent if you have a free hand, or shoving your opponent if both hands are in use.",
      "50-59": "You attempt to disarm your opponent. Effect: You are able to take the disarm action after your attack",
      "60-69": "You kick your target’s weapon out of their hands. Effect: You are able to take the disarm action after your attack, and can steal your opponents weapon if you have a free hand. Otherwise you can knock it up to 20 feet away.",
      "70-74": "Your senses heighten and you become aware of threats around the battlefield. Effect: You are able to use the dodge action after your attack.",
      "75-79": "Your attack knocks your target over. Effect: Your target is knocked prone.",
      "80-84": "Your strike surprises your opponent. Effect: Your target is surprised until the end of their next turn.",
      "85-89": "You strike with great force. Effect: Roll an additional set of damage dice above and beyond your normal critical roll.",
      "90-94": "You strike with extreme force. Effect: Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers one unit of exhaustion.",
      "95-99": "You strike with debilitating force. Effect: Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers a permanent injury chosen by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar.",
      "100": "You strike with devastating force. Effect: Roll an additional set of damage dice above and beyond your normal critical roll, and the target suffers 1 unit of exhaustion, and the target suffers a permanent injury chosen by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar."
    },
    "spell": {
      "1": "You feel accomplished, but nothing remarkable happens. Effect: Regular spell critical hit.",
      "2-5": "You feel it is imperative to press the advantage no matter the cost. Effect: You can choose to gain advantage on your next attack roll against your target, but all enemies have advantage on their attack rolls against you until the end of your next turn.",
      "6-9": "You feel it is imperative to press the advantage, but maintain awareness of your surroundings. Effect: You can choose to gain advantage on your next attack roll against your target, your target has advantage on their attack rolls against you until the end of your next turn.",
      "10-14": "As you are fighting, you notice an effective route to escape danger. Effect: You are able to use the disengage action after your attack.",
      "15-19": "You feel the eb and flow of the battle, and know where to make your next move. Effect: After your turn you move to the top of the initiative order.",
      "20-29": "Your spell cripples your opponent. Effect: Your target’s movement speed is cut in half for their next 2 turns.",
      "30-39": "Your spell attack knocks your target over. Effect: Your target is knocked prone.",
      "40-49": "The light from your spell flashes near your target’s eyes Effect: Your target is blinded until the end of their next turn.",
      "50-59": "You blast the targets weapons out of their hands. Effect: Your target’s weapon is flung 1d6*5 feet away in a random direction.",
      "60-69": "The sight of your magic fills the target’s heart with fear. Effect: Your target is frightened by you until you stop casting magic. You are able to discern the source of your targets fear.",
      "70-74": "The force from your spell stuns your opponent. Effect: Your target is incapacitated until the end of their next turn.",
      "75-79": "Your spell is incidentally infused with fey energy. Effect: Roll 10d8. If your targets current health is lower than the number rolled they fall asleep for 1 minute.",
      "80-84": "Your spells strike surprises your opponent. Effect: Your target is surprised until the end of their next turn.",
      "85-89": "Your spell strikes with great force. Effect: Roll an additional set of spell damage dice above and beyond your normal critical roll.",
      "90-94": "Your spell strikes with extreme force. Effect: Roll an additional set of spell damage dice above and beyond your normal critical roll, and the target suffers one unit of exhaustion.",
      "96-99": "Your spell strikes with debilitating force. Effect: Roll an additional set of spell damage dice above and beyond your normal critical roll, and the target suffers a permanent injury chose by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar.",
      "100": "Your spell strikes with devastating force. Effect: Roll an additional set of spell damage dice above and beyond your normal critical roll, and the target suffers 1 unit of exhaustion, and the target suffers a permanent injury chose by the DM. The permanent injury can be healed with extended rest of a length determined by the DM, but the attack leaves a scar."
    }
  },
  "BCoydog": {
    "melee": {
      "01-02": "Nothing personal… maybe: You goad your target and they become distracted by you. All of their attacks must be made at Disadvantage until the end of your next turn.",
      "03-04": "Off kilter: Your strike knocks the target off-balance; the next attack against them has Advantage.",
      "05-06": "With flourish!: Your strike is executed with perfect form and all take notice. You may make a contested intimidation check against their WIS Save. On a success, the target becomes Frightened of you for 1d4 rounds.",
      "07-08": "GTFO of my way!: Adrenaline courses through you with primal fury. You smash your weapon into your enemy and may (at your discretion) push them up to 10 feet away in a straight line. This does not provoke an attack of opportunity from nearby creatures.",
      "09-10": "Clean sweep!: It’s a clean sweep! You deal the normal double damage and knock your opponent off-balance and prone.",
      "11-12": "Plan See: Whether intentional or poor luck, your opponent becomes blinded for one round. Maybe it was sweat, blood… tears? Maybe it was pocket sand! Either way, they are blinded until your next turn. They can end this condition early by using their action to wipe their eyes.",
      "13-14": "Ah! My digits!: You slam their hand and/or fingers with your attack and they drop their weapon as a result of the pain.",
      "15-16": "Kneecapped: Yep, you guessed it. You strike their leg with enough force to cause something to… not feel quite right. The target’s movement speed becomes halved and they have disadvantage on all DEX Saves for the next 1d4 rounds.",
      "17-18": "Woah… easy dude…: Your ferocity knows no bounds and the enemy takes note. All other enemy combatants within 15 ft of you become Frightened of you until the end of your next turn",
      "19-20": "Adrenaline: Epinephrine begins to course through your veins as the heat of battle causes you to enter a state of pure adrenaline, numbing the blows of battle. You have resistance to all types of damage until the end of your next turn.",
      "21-22": "Hey! Look over here!: You draw the target’s attention and open them up for an attack, but not by you. The nearest friendly combatant closest to you gains Advantage on all attacks made against the target on their next turn. Similarly, they may also move away from the target without incurring an Attack of Opportunity.",
      "23-24": "Fancy Footwork: Your ability to maneuver the battlefield after an attack is remarkable! You may move up to half your movement speed without provoking an Attack of Opportunity from the target of this attack.",
      "25-26": "Don’t Stop Me Now: Because you’re having a good time, having a good time! Roll a performance check (DC = Target’s AC). On a success, the target of this attack avoids you at all cost until the end of your next turn. Alternatively, you may become the focus of the target’s ire until the end of your next turn. Your choice!",
      "27-28": "Insult to Injury: Your attack hits with such skill you immediately apply one of the three effects: Bludgeoning, target is stunned for one round. Piercing, enemy takes an additional damage die worth of damage. Slashing, enemy takes 1d4 bleed at start of their turn until they use an Action to pass a DC 12 Medicine Check.",
      "29-30": "I’m about to start swinging…: You’re a crazy person! A loose cannon! Out of control, I say! Your sheer force of will and determination to resolve this, ends with you swinging wildly, either with brute force or finesse. Gain one free attack.",
      "31-32": "It’s personal…: You know what? Yeah, it is personal, you’re about to clock them one. You may make a free Unarmed Strike against the target of this attack, dealing normal damage.",
      "33-34": "Stalwart Offender: You catch your opponent off-guard and reposition them, much to their dismay. You may reposition the target to another square within 5 ft of you and another friendly combatant. If this cannot be accomplished, you may reposition the target in an adjacent square within 5 ft of you.",
      "35-36": "Hit. Die.: Adrenaline begins to fuel your swings and you feel like you can keep going. You may, at your choosing, roll one of your hit die and add the result plus your CON Modifier to your health.",
      "37-38": "Called Strike: You may make a called strike, with the following effects: Hands - Target drops Weapon. Arms - Target makes all attacks at Disadvantage until end of your next turn. Legs - Target’s movement speed is halved until the end of your next turn. Head - Roll another attack roll, if this hits, deal Triple Damage.",
      "39-40": "Hellooo Cleave-land!: You swing with such force and malice that your swing continues to the nearest adjacent target, dealing regular damage. If there is a third target available, adjacent to the second target, roll an attack roll. If this hits, roll regular damage. This effect then ends.",
      "41-42": "Deft Battlefield Tactician: Your ability to avoid damage and keep moving is incredible. The next attack made against you (Melee, Ranged, or Spell Attack) deals no damage to you. Critical Hits are the only exception to this.",
      "43-44": "Sleight of Hand: If you have a thrown weapon in your inventory, you may make a free ranged attack with it. If you do not, you may make a free pommel/shaft/haft/hilt strike against the target of this attack, dealing 1d4 bludgeoning damage.",
      "45-46": "What do we say? Not today.: Either through sheer spite, determination, stubbornness, or vitriolic hate, you refuse to die. The next time you drop to zero hit points, you are instead only brought down to 1hp.",
      "47-48": "Whatcha got there?: Your attack strikes their bandoleer, pocket, backpack, or other container. They drop one carried item which lands in your square. If they are not carrying any applicable items, they drop 2d10 gold pieces which land in your square.",
      "49-50": "It won’t stop!: You strike something that shouldn’t have been struck. Your target takes 1d4 bleeding damage at the beginning of each of their turns until they (or someone else) use an action to stop the bleeding.",
      "51-52": "[confused screaming]: You hit your target with such precision and ferocity that they are at a loss for how to react. They forego all actions on their next turn.",
      "53-54": "Strike Fear: You scream or otherwise demoralize the nearest combatant. Roll an intimidation check against the target’s AC, if you succeed, the combatant cannot use its Action during its next turn.",
      "55-56": "Tendon Strike: You assail your target in a sensitively crippling area, their movement speed is halved until the end of your next turn. Alternatively, they can use an action to undo the damage.",
      "57-58": "Two-Pronged Attack: You motivate a friendly creature to make a free attack, if they so choose. This can only be done if they have their Reaction available for the round and are not incapacitated.",
      "59-60": "Distraction: If you so choose, you may become the center of attention for all hostile creatures within 5 ft of you, causing all affected creatures to focus on you until the end of your next turn. This can take the form of a taunt, a battle cry, or obscene profanities involving the target’s mother.",
      "61-62": "Hardy Target: Add your CON Modifier to your AC until the end of your next turn.",
      "63-64": "Catch These Hands: Your reach increases by 5 ft until the end of your next turn",
      "65-66": "Diss and Gauge: You gauge the level of your enemy’s focus, and you see an opening, you may move the full complement of your movement speed during this round only without provoking any attacks of opportunity.",
      "67-68": "Parry Situation: Roll a d4, the result is added to your AC until the end of your next turn.",
      "69-69": "Nice.: You deal the maximum amount of damage possible. Nice.",
      "70-71": "Bearhug: Make love, not war. But instead of a loving embrace, you may choose to suplex the enemy. As part of your attack, you may perform a contested grapple. On a success, you slam the opponent into the ground, forcing them prone, and dealing 1d6 + your STR Modifier (minimum 1) in bludgeoning damage. This cannot be performed on an enemy that is a size category larger than you.",
      "72-73": "You Get a Hit, and You Get a Hit!: Just because one target is the lucky recipient of your Critical Hit, doesn’t mean you can’t share the love. If available in your inventory, you may make one additional attack with a thrown weapon to an enemy within range (without penalty from the current target).",
      "74-75": "Motivational Speaker: Your words carry just as much vigor as your swings. In addition to slamming your weapon of choice into someone’s body, your battle cry sends a motivating message through one of your allies. One ally of your choosing receives Temporary HP equivalent to 1d6 + your CON Modifier (minimum 1).",
      "76-77": "Sweep the Leg: Make another Attack Roll, if the result would be a hit, you successfully trip the target and knock them prone. If the result is a Natural 20, you deal triple damage in addition to the prone condition.",
      "78-79": "Champion: Roll a d4. Until the end of your next turn, your Crit Range is expanded equivalent to the result of the die roll.",
      "80-81": "Bloodied: If you are at half of your hit points or below when this Critical effect is applied, double the total amount of damage which results from the Critical, effectively quadrupling your damage output. This Critical effect cannot be used more than once per in-game day.",
      "82-83": "Bop it!: In addition to the double damage dealt, you may also make an additional pommel/hilt/haft strike with the blunt end of your weapon, dealing 1d4 + your STR/DEX Modifier (your choice) in bludgeoning damage.",
      "84-85": "50% Off!: Until the end of your next turn, as a reaction, you may negate half of any physical damage dealt to you by any one single attack.",
      "86-87": "Namaste: If you are currently experiencing any mind-affecting effects, you can make the appropriate Saving Throw immediately in an attempt to end the effect.",
      "88-89": "Double-Edged Approach: You give yourself Advantage on all attacks until the end of your next turn, but all attacks against you are made at Advantage as well.",
      "90-91": "Later!: You may use the Disengage Action as a Bonus Action within this turn, assuming you have a Bonus Action and movement speed to use.",
      "92-93": "Paradigm Avoidance: The target of this attack becomes too predictable for you to become susceptible to their attacks. You gain a permanent +1 bonus to AC against the target of this attack until their hit points reach zero.",
      "94-95": "Hide and Seek: You may use the Hide Action as a Bonus Action within this turn, assuming you have a Bonus Action and movement speed to use.",
      "96-97": "Hard to Get: You may use the Dodge Action as a Bonus Action within this turn, assuming you have a Bonus Action and movement speed to use.",
      "98-99": "Going, Going, Gone!: You may use the Dash Action as a Bonus Action within this turn, assuming you have a Bonus Action and movement speed to use.",
      "100-100": "100% Reason to Remember the Name: Roll a d100. On a roll of 91 or higher, you deal quadruple damage. This Critical effect cannot be used more than once during any in-game day."
    },
    "ranged": {
      "01-02": "Are they tired?: Your shot lands with such precision that it cripples your opponent. The target falls to the ground prone.",
      "03-04": "Ricochet: Your projectile passes through the target and ricochets off of a nearby object, towards another enemy target, dealing half damage. The target is chosen at random and determined by the DM.",
      "05-06": "Crippling Shot: Your projectile strikes the target in a painful meaty spot and nullifies their ability to move. The target’s movement speed becomes 0 until the end of their next turn.",
      "07-08": "Heightened Awareness: You are in the zone and ready for whatever comes next. The next attack made against you is made at Disadvantage.",
      "09-10": "Disarming Strike: Make another attack roll with the same bonus to hit, if this would still hit your target, they drop their weapon. If they are not wielding a weapon, they take an additional damage die worth of damage.",
      "11-12": "Frightening Accuracy: Your ability to strike the target with pinpoint precision is uncanny and unerring. The target of this attack becomes Frightened of you for the next 1d4 rounds.",
      "13-14": "Personal Space: If this attack was made while a hostile creature occupies a square within 5 ft of you, you may make a free melee attack against them. If this hits you may push them up to 5 ft away in addition to the regular damage.",
      "15-16": "Hard To Pin Down: Your agility and battlefield prowess make you hard to pin down. Until the end of your next turn, all attacks made against you are made with Disadvantage.",
      "17-18": "Distracting Strike: The target is caught off-guard by your attack and leaves them open for a follow-up strike. If a friendly combatant is within 5 ft of the target of this attack, they may use their reaction to make a free attack against the target with Advantage.",
      "19-20": "Follow Through: Your strike hits a soft part on the target, passing straight through them. If there is another hostile creature beyond the target of this attack, in a straight line, roll another attack roll. If this hits, deal normal damage to the second target.",
      "21-22": "Do I leave it in or take it out?!: Your arrow lands square in the target’s chest and they panic for a moment as they debate whether or not to remove it. Until the end of their next turn, the target has disadvantage on all Saving Throws.",
      "23-24": "Backseat Driver: You’ve got moxie, kid! Your words are as motivating as your shot. As a free action, you may inspire the nearest friendly combatant to your location to advance toward the target of this attack. If they decide to do so, they may move up to half their movement speed without provoking an Attack of Opportunity.",
      "25-26": "Monkey See, Monkey Do: Hey, you set a great example of how to send things flying through the air with great results! A party member of your choice that has line of sight on you or the target may use a reaction to make a ranged attack or use a thrown weapon against a target of their choosing.",
      "27-28": "Pinned Down: Either through malicious intent or a happy accident, your projectile pins the target in place. This can happen with any body part of the DM’s choosing. Your target’s movement speed becomes zero until they use an Action to remove the projectile.",
      "29-30": "Your aim sucks!: You are nearly impossible to hit! The next hit made against you deals no damage. The only exception is a Critical Hit.",
      "31-32": "To shreds you say…: The projectile hits with such force it explodes. It is unfortunate that you have lost your projectile, but even more unfortunate that your enemy has suffered an additional 1d6 piercing damage and is blinded for the next 1d4 rounds.",
      "33-34": "Emotional Damage!: Well… that can’t feel great, you strike your target in a very sensitive area. You deal triple damage and your target must make a CON Save equal to 8 + your Prof. Bonus + Main Class Ability Score Modifier. On a fail, they vomit and become prone.",
      "35-36": "Please, I Insist: If you so choose, you may forego the double damage you would deal from this Critical Hit to produce the following effect. Choose a teammate, if they have a reaction available, they may make a single attack against the target of this Critical Hit. If they hit, it is treated as a Critical Hit.",
      "37-38": "Called Shot: You may make a called shot, with the following effects: Hands - Target drops Weapon. Arms - Target makes all attacks at Disadvantage until end of your next turn. Legs - Target’s movement speed is halved until the end of your next turn. Head - Roll another attack roll, if this hits, deal Triple Damage.",
      "39-40": "Bow to Me: Your target must make a CON Save (DC = 8 + Your Proficiency Bonus + Main Class Ability Score Modifier) on a fail, they take 1d4 bleed damage for the next 1d4 rounds.",
      "41-42": "You know what? Screw this.: Your generosity to the nearest hostile creature has burnt out, you’ve had enough of them encroaching upon you. You may forego your ranged attack and make a melee attack against a target within 5 ft of you with the same ranged attack numbers (to hit and damage).",
      "43-44": "Just You Wait…: On your next turn if the target of this attack is still alive, you gain one free attack if the attack is made against them.",
      "45-46": "Absolutely stunning!: Your shot hits something just right and causes the target to feel oh so wrong. The target becomes Stunned until the end of your next turn.",
      "47-48": "They used to be an adventurer…: You know how this goes. Your projectile lodges itself right into their knee, and by the forces of sheer will from the year 2011, they are no longer an adventurer. Also, their speed is halved.",
      "49-50": "Sleight of hand: Your adrenaline kicks in and the enemy should be worried. Gain an additional attack.",
      "51-52": "Another One: How about one, or two, or twenty. Just keep going, send a hail of projectiles, make it rain terror. You can make one additional attack.",
      "53-54": "Commanding Presence: You instill a sense of vigor and valiance in one ally who is furthest from you, but within your line of sight. If they have a reaction available, they may use it to make a single attack.",
      "55-56": "Call of Nature: Your strike causes agitation in the nearest avian creature. The agitation becomes directed at the target of your attack, causing a Giant Eagle to swoop down and make a multiattack against the target. It takes its turn directly after yours and departs after its turn ends. Its movement does not provoke attacks of opportunity.",
      "57-58": "Hollow Point Rounds: The projectile collides with a hard point beneath the surface of the combatants flesh, and explodes dealing 2d4 piercing damage. The target must then roll a CON Save, on a fail they sustain an additional 1d4 bleed damage at the start of each of their turns until they use an Action to stem the bleeding.",
      "59-60": "Armor Piercing Rounds: Your shot is fired with such intense velocity that the nearest hostile creature behind the target, in a straight line from your space, sustains the same amount of damage as the target.",
      "61-62": "Ring Their Bell: If you so choose, your shot strikes the target’s helmet (or equivalent hard surface) and renders them incapacitated until the end of your next turn.",
      "63-64": "How Magical!: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to redirect your projectile, possibly striking another target. Roll another Attack Roll to hit the secondary target. If this hits, it deals normal damage.",
      "65-66": "Crippling Shot: Your shot wounds the target enough to cause them to go off-balance and fall prone.",
      "67-68": "Dirt in the Wound: Your ability to rally your teammates in combat is inspiring. If you have an ally within 5 ft of the target of this Critical Hit, and they have a reaction available, they may use their reaction to make a single attack against the target.",
      "69-69": "Nice.: You deal the maximum amount of damage possible. Nice.",
      "70-71": "Sniper’s Eye: You begin focusing in… your pulse slows… your breath steadies… and you are ready to make the next shot count. When you make your next Attack Roll, you can add 1d6 to it.",
      "72-73": "Follow-Through: You shoot to kill and this is no different. On the next Ranged Attack you land a hit on, add 1d6 to the damage dealt. If this next attack results in a Critical Hit, the 1d6 is not doubled as a result of the Crit.",
      "74-75": "Hard to Pin Down: Immediately after the resolution of this Critical Hit, you may move half your movement speed in any direction. This does not provoke any attacks of opportunity or count towards your regular movement speed.",
      "76-77": "Dodgy Character: At the end of your turn you may, as a Bonus Action, take the Dodge Action. If your character already has the ability to do so, add +2 to your AC until the end of your next turn.",
      "78-79": "Awe-Struck: The prowess in which you effectively execute upon a perfected shot is nothing short of artful to behold. The target of this Crit becomes dazed by your shot. They cannot take Actions during their next turn and can only move half their movement speed.",
      "80-81": "Use the Force: The strength of your shot is enough to cause your target to stumble backwards as they are struck with force. The target sustains 1d4 Force damage, and is pushed back 10 feet.",
      "82-83": "Burning Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Fire damage to your shot.",
      "84-85": "Icy Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Cold damage to your shot.",
      "86-87": "Deathlike Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Necrotic damage to your shot.",
      "88-89": "Radiant Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Radiant damage to your shot.",
      "90-91": "Toxic Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Poison damage to your shot.",
      "92-93": "Chemical Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Acid damage to your shot.",
      "94-95": "Heavenly Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Lightning damage to your shot.",
      "96-97": "Booming Synergy: If you have a spellcaster in your adventuring party with a reaction available, they may use their reaction to enhance your hit by dealing an additional 2d4 Thunder damage to your shot.",
      "98-99": "Expeditious Maneuvers: You move faster than normal as the adrenaline begins to course through your body. Your movement speed increases by 10 ft this round and you incur no attacks of opportunity from moving this round.",
      "100-100": "BFG: Your aim is true and your projectile strikes with lethal impact. You deal triple damage."
    },
    "magic": {
      "01-02": "Where the fuck I am?: Your ability to channel magic is so overwhelming you daze your opponent in a blast of Arcane prowess. On your opponents next turn they are confused and forego their turn and instead move in a random direction up to their movement speed. This is determined at random by the DM.",
      "03-04": "What a blast!: You strike your target with utter power, all enemy combatants within 5 ft of the target take 1d4 Force damage.",
      "05-06": "I have seen into the void…: Your magic impacts your target with such fearsome might that they begin to second guess attacking you. Your target becomes frightened of you until the end of your next turn.",
      "07-08": "Eye, eye!: Either you’re a sharpshooter… or just plain vindictive, or maybe the target has bad luck… because your spell slams into their face. Your target becomes blinded until the end of their next turn.",
      "09-10": "Yeah, take that!: A spark of wild arcane magic flies off of your target and strikes the nearest hostile combatant, closest to your target, dealing half damage.",
      "11-12": "Fragmented Augmentation: Wild magic flits about in a violent fashion as the magics of old beg to be released. Your magical attack deals an additional 1d8 fire damage and 1d8 force damage.",
      "13-14": "Touch of Death: As death creeps nearer to the affected target, the magics cry out to assist. The target takes an additional 1d8 cold damage and 1d8 necrotic damage.",
      "15-16": "You’re doing great, Sun: You’re the shining star in this moment and apparently so is the target of the spell. You deal an additional 1d8 fire damage and 1d8 radiant damage in addition to the critical damage.",
      "17-18": "Leech Life: By some strange and powerful method of magical application, your attack draws the life force from the target of this spell. You are healed for half of the damage dealt (rounded down).",
      "19-20": "I can hear colors!: The enemy was caught off guard and your affinity for applying spellcasting in this situation is nothing new to you. In addition to the critical damage, you deal an additional 2d6 acid damage.",
      "21-22": "What in Tar Nation: The magic goes haywire as it strikes the target of your spell. The magics congeal at the base of your enemy’s position, holding them in place. Your opponent becomes grappled until the end of your next turn. They can attempt a STR (Athletics) Check to escape, equal to your Spell Save DC.",
      "23-24": "Catch me if you can!: You juggle your ability to channel magic and similar to the Eladrin, you are gone in a puff of mist. Immediately after casting this spell you may teleport up to 10 ft away from your current position, this is part of your movement.",
      "25-26": "What? What?! WHAT?!: Either through precise aim or unfortunate luck, your magic collides with the target’s head (or whatever resembles a head) and deafens them until the end of their next turn.",
      "27-28": "Go my own way: Most mages prefer their personal space and perhaps you are no different. Immediately after casting this spell you may move up to half your movement speed. This does not provoke Attacks of Opportunity.",
      "29-30": "I don’t think so…: Your magical affinity gives you a level of foresight. You gain a +2 to your AC against any attacks made against you from the target of this spell until the end of your next turn.",
      "31-32": "Back! Back, I say!: The force of your magical attack strikes the target with enough force to push them away from you 10 ft in a straight line. If this causes the target the collide with a solid object, it deals an additional 1d6 bludgeoning damage.",
      "33-34": "Conduit of Chaos: Your target’s ability to maintain focus on anything but staying conscious after your strike becomes a conscious effort. If they are maintaining concentration on a spell it is immediately lost. Additionally, they have disadvantage on all Saving Throws until the end of your next turn.",
      "35-36": "Divine Wrath: Whether you have ties to a deity, a darker entity, or a strong sense of devotion to an ideal, it manifests and becomes almost tangible. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Radiant damage, or half as much on a successful one.",
      "37-38": "Explosive rounds: The target is struck with raw magical power, sustaining an additional 4d4 Force Damage and is pushed back 10 feet.",
      "39-40": "Great Old One’s Touch: For one reason or another, your spell causes a momentary rift to open. A nightmarish and elongated tentacle emerges, lashing out at nearby targets, making contact with the target of this spell. The creature takes 2d6 bludgeoning damage in addition to the critical damage.",
      "41-42": "Room for one: Most spellcasters are at home when they are not being crowded. Immediately after casting this spell, you may make a free melee attack against a hostile creature that is within 5 ft of you. Use your Spell Attack modifier, dealing your Spellcasting Ability Modifier in damage (minimum 1).",
      "43-44": "Get over here!: Whether the nature of an elegant Bladedancer has begun to rub off on you, or you are looking to drive a message home, you bring your target closer. Your magics draw them in. As part of the attack you may pull your target towards you 10 ft in a straight line.",
      "45-46": "Disruptive Measures: Magic, whether divine, innate, ancient, or arcane, is unpredictable at times. You may forego the damage dealt by this Critical Hit, turning it into Evocative Healing energy instead. This only applies to the caster of the spell and cannot be shared with other combatants.",
      "47-48": "Once every blue moon…: The planets align and things are looking up… just not for your foe. Roll a d100. 01-75, target takes an additional 50% more damage (rounded down). 76-100, target takes 50% more damage (rounded down) and becomes Stunned until the end of their next turn.",
      "49-50": "Catastrophic Anomaly: Either through calm focus or brute force, your attack strikes your foe psychologically. Your spell attack deals an additional Xd6 Psychic Damage. X = Spell Level.",
      "51-52": "Savior of Saves: The Weave’s connection to you and your ability to harness it become protective and beneficial in your defense. Until the end of the current encounter, you gain a +1 Bonus to all Saving Throws.",
      "53-54": "I’ve Become So Numb: Your magic has affected the target’s nervous system, causing a numbness to overtake them. They have disadvantage on all Attack Rolls made until the end of your next turn.",
      "55-56": "You’re Fired: The focal point where the magics collide begin to overheat, causing the immediate area to become dangerously hot. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Fire damage, or half as much on a successful one.",
      "57-58": "Cold Front: The power used in the casting of this spell removes all energy in the immediate area of the target, causing a hypothermic level of cold. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Cold damage, or half as much on a successful one.",
      "59-60": "Shocking Developments!: The target of the spell is struck with a violent level of force, causing an unnaturally high level of friction, discharging all built up energy into them. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Lightning damage, or half as much on a successful one.",
      "61-62": "Hydrochloric Happenstance: The chemical properties of the elements within the immediate vicinity of the target become volatile and destabilized. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Acid damage, or half as much on a successful one.",
      "63-64": "Noxious Maltreatment: A clash of chemical imbalance collides and the target of the spell is the one who will suffer this fate. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Poison damage, or half as much on a successful one.",
      "65-66": "Stormfront: The volatility of the magics causes a destabilization of air pressurization, causing a stormfront. Except only for the target. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Thunder damage, or half as much on a successful one.",
      "67-68": "Wither Away: The intention of harm begins to manifest through the magics you have conjured as the conduit between you and the Weave. The target of this spell must make a CON Saving Throw against your Spell Save DC. On a failure, they suffer an additional 3d6 Necrotic damage, or half as much on a successful one.",
      "69-69": "Nice.: You deal the maximum amount of damage possible. Nice.",
      "70-71": "Altered State: Your ability to manipulate your tie to the Weave is uncannily unerring, almost frightening. You are a gifted expert in your craft, or really lucky! In this moment, you grasp the deeper meaning of the magics you manipulate and can alter their elemental type upon casting.",
      "72-73": "Second Wind: You feel the same rush that the guy in heavy armor who swings giant weapons feel… you get it, you sense this overwhelming surge of power, adrenaline, and even… potential. The Spell Slot used in the casting of this spell is not expended. This Critical effect cannot be used more than once per in-game day.",
      "74-75": "Who’s a Good Boy?!: Your attempt at pulling in the elements was not only wildly successful but they have brought a friend with them! In the casting of the spell, your magics summon a Hell Hound within 5 ft of the target of this spell. It takes its turn right after you and is under your control. After its turn it is immediately returned to its plane of existence.",
      "76-77": "Blowhard: Perhaps caused by the whirlwind of clashing magics, or something else entirely, there is a new combatant. The magics used in the casting of this spell cause an Air Elemental to form in a space within 5 ft of the target of this spell. Its turn comes right after yours and is hostile to all targets on the battlefield, prioritizing the target of this spell. It vanishes at the end of its turn.",
      "78-79": "Earth Win, and… Fire!: Maybe Mother Nature is angry, maybe the earth beneath you is tired of being walked all over like dirt, well… yeah… anyway, an Earth Elemental forms in a space within 5 ft of the target of this spell. Its turn comes right after yours and is hostile to all targets on the battlefield, prioritizing the target of this spell. It vanishes at the end of its turn.",
      "80-81": "Water You Doing?!: When it rains, it pours. The clashing of magics used in the spells casting causes a Water Elemental to form in a space within 5 ft of the target of this spell. Its turn comes right after yours and is hostile to all targets on the battlefield, prioritizing the target of this spell. It vanishes at the end of its turn.",
      "82-83": "Ready… Maim… Fire!: Time to turn up the heat! The friction of magics have caused a Fire Elemental to form in a space within 5 ft of the target of this spell. Its turn comes right after yours and is hostile to all targets on the battlefield, prioritizing the target of this spell. It vanishes at the end of its turn.",
      "84-85": "Blunt Force Trauma: The weapon the enemy is using becomes animated and attacks the target of this spell. It shunts itself backwards, into their face, causing 1d6 + Your Spellcasting Ability Modifier in bludgeoning damage. If the enemy is not holding a weapon, it strikes itself in its confusion. Just like the good ol’ days.",
      "86-87": "Popping Smoke: Either through a sheer gust of wind, fire and brimstone, or an overload of magical force, there is a distractingly obstructive burst of smoke. All targets within 5 ft of the target of this spell, including the target, are obscured in a momentary smokescreen. All attacks made by the affected targets must make all attacks at disadvantage until the end of your next turn.",
      "88-89": "Harrowing Company: The necrotic forces at work which harbor a sense of dread and violence between death and undeath begin to manifest itself into the goodest of boys, hopefully. Your magics summon a Harrow Hound within 5 ft of the target of this spell. It takes its turn right after you and is under your control. After its turn it immediately rejoins the plane from which it came.",
      "90-91": "Valiant Steed of Beauty: There is a collision of good and evil, and in this moment, a rare occurrence happens before your very eyes. The warring between the forces of good and evil strike a balance as a Unicorn leaps from the tear in reality, created by the magics you have wrought. The Unicorn spawns within 5 ft of the target of this spell. It takes its turn right after you and is under your control. After its turn it immediately rejoins the plane from which it came.",
      "92-93": "Death By a Thousand Cuts: Either you have summoned a knife storm native to Ooo, a maelstrom of blades have materialized into the space occupied by the target, or some other strange and amusing phenomena has taken place. An abundance of razor sharp material manifests into the space of the target of this spell, causing 4d4 slashing damage as they whirl around the target and vanish just as soon as they appeared.",
      "94-95": "Size Matters: The raw power used to shape the magics you used in the casting of this spell begin to tether themselves to your being. If you choose, you can accept the temporary changes that come with the wild magics that wrap themselves around you. Doing so allows you to increase your size by one size category for the next 1d4 rounds.",
      "96-97": "Nonmagical Defiance: The raw magical energy from the school of Abjuration encompasses your form and protects you from harm. Until the end of your next turn you have resistance to nonmagical bludgeoning, piercing, and slashing damage.",
      "98-99": "Hither and Tither: The force from the strike of your magics causes the target to be blasted 10 ft in a straight line either toward you, or directly away from you.",
      "100-100": "Insight of the Weave: For a moment, you gain a glimpse into the mysteries and lost practices surrounding the magics of old. Roll a d100: 1-90 = Triple Damage / 91-100 Triple Damage and Roll again, taking an additional Critical Hit effect. If you roll a 100 and the CR of the creature is equal to your level or lower, it is instantly slain."
    }
  },
  "effects_tables": {
    "minor_injuries": {
      "1-3": "Injured leg! The creature’s movement speed is reduced by 10 feet.",
      "4-8": "Injured arm! Randomly determine one of the creature’s arms. That arm cannot be used to hold a shield and the creature has disadvantage on any rolls involving the use of that arm.",
      "9-11": "Multiple injuries! The creature’s maximum hit points are reduced by an amount equivalent to half of the damage dealt by the attack.",
      "12-16": "Badly beaten! The creature has disadvantage on Constitution saving throws.",
      "17-19": "Sent reeling! The creature is stunned until the end of its next turn and deafened until it completes a recuperate downtime activity.",
      "20": "Devastating injury! The creature is unconscious for 2d12 hours."
    },
    "major_injuries": {
      "1-3": "Crippled leg! The creature’s movement speed is reduced by 10 feet and it has disadvantage on Dexterity saving throws.",
      "4-8": "Crippled arm! Randomly determine one of the creature’s arms.  That arm cannot be used to hold an item and any ability check requiring that arm automatically fails or has disadvantage (DM’s choice).",
      "9-11": "Severely wounded! The creature’s maximum hit points are reduced by an amount equivalent to the damage dealt by the attack.",
      "12-16": "Edge of death!  The creature has disadvantage on Constitution and death saving throws.",
      "17-19": "My eyes! The creature is blinded.",
      "20": "Decapitated! The creature is dead."
    },
    "insanities": {
      "1": "Synesthesia. You can hear colors, smell sounds, or taste textures. Regardless of the specific manifestation, you have disadvantage on all Perception and Investigation skill checks.",
      "2": "Kleptomania. Once per day when you are in a personal residence or marketplace, the DM can call on you to succeed on a Wisdom saving throw (DC 12) or attempt to steal an item of insignificant practical and monetary value.",
      "3": "Paranoia. Once per day following an interaction with another creature (including other PCs) the DM can call on you to succeed on a Wisdom saving throw (DC 12) or you suspect that creature is secretly plotting against you.",
      "4": "Obsession. Choose a person or personal interest you are obsessed with. Once per day, when you are presented with an opportunity to interact with or learn more about the subject of your obsession the DM can call on you to succeed on a Wisdom saving throw (DC 14) or ignore everything else to obsess over the object of your fascination.",
      "5": "Addiction. Choose a behavior or substance you have used. Once per day, when you are presented with an opportunity to do the behavior or use the substance the DM can call on you to succeed on a Wisdom saving throw (DC 14) or ignore everything else to indulge in your vice.",
      "6": "Odd Thinking. Once per day when you hear a rational explanation for an event or occurrence, your DM may call on you to succeed on a Wisdom saving throw (DC 12) or you reject the rational explanation for a conspiratorial or fantastical explanation.",
      "7": "Narcissism. When you take an action or series of action that doesn’t directly benefit you, you must pass a Wisdom saving throw (DC 11) or you can’t take that action / series of actions. If any self-sacrifice on your part would be required the DC of the saving throw is increased to 16.",
      "8": "Delusional. When you gain this insanity the DM will tell you a belief that you have. No matter what evidence is presented to the contrary so long as you have this insanity you cannot be persuaded that this belief is not true.",
      "9": "Pica. Once per day the DM can call on you to pass a Wisdom saving throw (DC 14) or immediately eat one non-food object (such as dirt, napkins, or a small piece of jewelry) of the DM’s choice.",
      "10": "Retrograde amnesia. You forget everything about your personal life prior to the moment you received this insanity.",
      "11": "Overwhelmed. If you do not have immunity or resistance to psychic damage, you gain vulnerability to psychic damage. If you have resistance to psychic damage, you lose it. If you have immunity to psychic damage, you lose it but gain resistance to psychic damage.",
      "12": "Anterograde amnesia. Whenever you try to recall a fact you learned since you received this insanity, make a Wisdom saving throw (DC 12). If you fail you cannot recall the fact.",
      "13": "Dependence. You must pass a Wisdom saving throw (DC 14) to take an action that one or more of your allies disapprove of.",
      "14": "Anxious. You have disadvantage on saving throws against being frightened. Additionally, once per day the DM can call on you to succeed a Wisdom saving throw (DC 14) or be frightened by a creature of the DM’s choosing for the next minute.",
      "15": "Mute. Whenever you wish to speak allowed (including casting a spell that has verbal components) you must succeed on a Wisdom saving throw (DC 13) to do so.",
      "16": "Narcolepsy. You have disadvantage on saving throws against sleeping or unconsciousness. Once per day the DM may call on you to succeed on a Constitution saving throw (DC 12) or fall unconscious for one minute or until you take damage or another creature spends their action trying to rouse you.",
      "17": "Insomnia. You cannot take long rests and your short rests take 8 hours to complete.",
      "18": "Homicidal. After each long rest you must pass a Wisdom saving throw (DC 14) or be overcome with the urge to end the life of a humanoid creature and you cannot benefit from another long rest until you do so.",
      "19": "Suicidal. After each long rest you must pass a Wisdom saving throw (DC 12) or make an attempt to end your own life.",
      "20": "Catatonia. You are unconscious for 10d10 years."
    }
  }
}