{
  "Weapon Attack": [
    {
      "roll": "1",
      "description": "You are embarassed by your poor showing, but nothing remarkable happens.",
      "effect": "You miss your attack.",
      "lore": "Bards sing mournfully of Duelmaster Jorra's attempt to shouted the wrong incantation at a critical moment."
    },
    {
      "roll": "2-5",
      "description": "You lose your combat footing, exposing yourself to your target.",
      "effect": "Your target has advantage on their first attack roll against you next round.",
      "lore": "Historians still tell the story of Sir Galwyn, who famously fell into a decorative fountain while charging."
    },
    {
      "roll": "6-9",
      "description": "You lose your combat footing, exposing yourself to your enemies.",
      "effect": "Your enemies have advantage on their first attack roll against you next round.",
      "lore": "The archives of Thalem record a similar blunder during the Great Summit."
    },
    {
      "roll": "10-14",
      "description": "You lose your combat footing, and have difficulty recovering.",
      "effect": "Your enemies have advantage on their attack rolls against you until the end of your next turn.",
      "lore": "It is said that during the the Battle of Shifting Sands, Lady Myri tripped over their own weapon."
    },
    {
      "roll": "15-19",
      "description": "Melee: You get tangled with your enemy and fall over. Ranged: You spill your quiver.",
      "effect": "Melee: You are knocked prone and your movement is reduced to 0. Your target must succeed a DC 10 dexterity check or they are also knocked prone. Ranged: You must pick up arrows individually from the ground using your “environmental interaction”, or the “Use an Object” action to nock your bow.",
      "lore": "The archives of Stormwatch Keep record a similar blunder during the Great Summit."
    },
    {
      "roll": "20-29",
      "description": "You lose your balance while attacking.",
      "effect": "You fall prone and your movement is reduced to 0.",
      "lore": "The archives of The Mistlands record a similar blunder during the Siege of Broken Hill."
    },
    {
      "roll": "30-39",
      "description": "As you attack your opponent you begin to fear that they are the superior combatant.",
      "effect": "Disadvantage on your next attack roll against your target.",
      "lore": "The archives of The Mistlands record a similar blunder during the Siege of Broken Hill."
    },
    {
      "roll": "40-49",
      "description": "You miss an attack and gaze upon the chaos of the battle, causing your confidence to falter.",
      "effect": "Disadvantage on your next attack roll against any target.",
      "lore": "Historians still tell the story of Sir Galwyn, who famously summoned a chicken instead of a fireball."
    },
    {
      "roll": "50-59",
      "description": "You lose your grip as you attack.",
      "effect": "Roll a DC 10 Dexterity Check, on failure you drop your weapon at your feet.",
      "lore": "Historians still tell the story of Apprentice Threx, who famously shouted the wrong incantation at a critical moment."
    },
    {
      "roll": "60-69",
      "description": "Melee: The weapon slips from your hand as you attack. Ranged: Your ammunition gets lodged in its container.",
      "effect": "Melee: Roll a DC 10 Dexterity Check, on failure you throw your weapon into your enemy’s space. DM determines where the item is thrown on large sized or greater creatures. Ranged: You must use an action to organize the ammunition in its case before you can make another ranged attack.",
      "lore": "The archives of Stormwatch Keep record a similar blunder during the Festival of Lights."
    },
    {
      "roll": "70-79",
      "description": "Melee: You lunge past an enemy exposing yourself to his attack. Ranged: Your missile startles your allies near your target.",
      "effect": "Melee: Enemy you were attacking is able to use their reaction to perform and attack of opportunity. Ranged: the target can perform an opportunity attack on any ally within melee range.",
      "lore": "Legends from Silverdeep speak of the day a hero lost their footing before a duel."
    },
    {
      "roll": "80-84",
      "description": "Missing what you thought was a critical blow causes you to panic.",
      "effect": "End your current turn and you are surprised until the end of your next turn.",
      "lore": "Historians still tell the story of Arcanist Vorn, who famously tripped over their own weapon."
    },
    {
      "roll": "85-89",
      "description": "You attack wildly and lose track of the fight around you.",
      "effect": "End your turn and move to the bottom of the initiative order at the start of the next round.",
      "lore": "It is said that during the the Siege of Broken Hill, Velruun lost their footing before a duel."
    },
    {
      "roll": "90-94",
      "description": "You lose your footing while attacking and fall to the ground bumping your head.",
      "effect": "You fall prone. Roll a DC 10 constitution save, on failure you take 1d6 damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious.",
      "lore": "It is said that during the the Siege of Broken Hill, Duelmaster Jorra froze mid-spell, overcome by sneezing."
    },
    {
      "roll": "95-99",
      "description": "You lose your footing while attacking and fall head first.",
      "effect": "You fall prone. Roll a DC 15 constitution save, on failure you take 2d6 damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious.",
      "lore": "Historians still tell the story of Duelmaster Jorra, who famously tripped over their own weapon."
    },
    {
      "roll": "100",
      "description": "You lose your footing while attacking and slam your head into the ground.",
      "effect": "You fall prone, take 3d6 damage, and become unconscious for 1 minute or until you receive damage from any source.",
      "lore": "Even the great Velruun once shouted the wrong incantation at a critical moment."
    }
  ],
  "Spell Attack": [
    {
      "roll": "1",
      "description": "You are embarassed by your poor showing, but nothing remarkable happens.",
      "effect": "You miss your attack.",
      "lore": "Velruun's misfortune in trying to fell into a decorative fountain while charging is still joked about today."
    },
    {
      "roll": "2-5",
      "description": "You get wrapped up in your spellcasting and forget to watch your target.",
      "effect": "Your target has advantage on their first attack roll against you next round.",
      "lore": "Tales of Seer Halmin warn against lost their footing before a duel."
    },
    {
      "roll": "6-9",
      "description": "You get wrapped up in your spellcasting and forget to watch your surroundings.",
      "effect": "All enemies have advantage on their first attack roll against you next round.",
      "lore": "Even the great Apprentice Threx once lost their footing before a duel."
    },
    {
      "roll": "10-14",
      "description": "You are so wrapped up in your spellcasting that you forget you are fighting a battle.",
      "effect": "All enemies have advantage on their attack rolls against you until the end of your next turn.",
      "lore": "The archives of Silverdeep record a similar blunder during the Festival of Lights."
    },
    {
      "roll": "15-19",
      "description": "Your spell creates a large plume of smoke obscuring your location.",
      "effect": "The area in a 5 foot radius around your location becomes heavily obscured for 1 minute. A strong breeze can blow away the smoke in 1 round.",
      "lore": "Legends from Stormwatch Keep speak of the day a hero fell into a decorative fountain while charging."
    },
    {
      "roll": "20-29",
      "description": "Your spell misfires knocking you over.",
      "effect": "You are knocked prone.",
      "lore": "The archives of Silverdeep record a similar blunder during the Battle of Shifting Sands."
    },
    {
      "roll": "30-39",
      "description": "The spell fires in an unexpected manner, causing your confidence in your abilities to falter.",
      "effect": "You have disadvantage on any spell attacks, and enemies have advantage against your spell savings throws until the end of your next turn.",
      "lore": "The archives of The Mistlands record a similar blunder during the Festival of Lights."
    },
    {
      "roll": "40-49",
      "description": "The placement of your spell startles your allies near your target, causing them to drop their guard.",
      "effect": "Your target is able to use their reaction to take an attack of opportunity on one of your allies in melee range.",
      "lore": "Bards sing mournfully of Apprentice Threx's attempt to fell into a decorative fountain while charging."
    },
    {
      "roll": "50-59",
      "description": "You scramble the ingredients of your component pouch or your focus becomes overloaded with magical energy and temporarily stops working.",
      "effect": "You are unable to perform material components to cast spells until the end of your next turn.",
      "lore": "Seer Halmin's misfortune in trying to accidentally cast a spell on themselves is still joked about today."
    },
    {
      "roll": "60-69",
      "description": "Your arm cramps as you cast.",
      "effect": "You are unable to perform somatic components to cast spells until the end of your next turn.",
      "lore": "Bards sing mournfully of Sir Galwyn's attempt to shouted the wrong incantation at a critical moment."
    },
    {
      "roll": "70-79",
      "description": "You bite your tongue as you cast.",
      "effect": "You are unable to use verbal components to cast spells until the end of your next turn.",
      "lore": "Historians still tell the story of Sir Galwyn, who famously froze mid-spell, overcome by sneezing."
    },
    {
      "roll": "80-84",
      "description": "Your spell misfires and dazes you, causing you to lose track of the fight.",
      "effect": "End your turn and move to the bottom of the initiative order at the start of the next round.",
      "lore": "The archives of Ashvale record a similar blunder during the Great Summit."
    },
    {
      "roll": "85-89",
      "description": "Your spell misfires causing you to panic.",
      "effect": "End your current turn and you are surprised until the end of your next turn.",
      "lore": "Legends from Bar Grunnd speak of the day a hero fell into a decorative fountain while charging."
    },
    {
      "roll": "90-94",
      "description": "Your spell backfires creating a small explosion causing you to fall and bump your head.",
      "effect": "You fall prone. Roll a DC 10 constitution save, on failure you take 1d6 bludeoning damage and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious.",
      "lore": "The archives of Bar Grunnd record a similar blunder during the Siege of Broken Hill."
    },
    {
      "roll": "95-99",
      "description": "Your spell backfires creating a large explosion causing you to fall and bump your head.",
      "effect": "You fall prone. Roll a DC 15 constitution save, on failure you take 1d6 bludgeoning damage, 1d6 thunder damage, and are knocked unconscious for 1 minute or until you receive damage from any source. On success take half damage and you remain conscious.",
      "lore": "Historians still tell the story of Apprentice Threx, who famously shouted the wrong incantation at a critical moment."
    },
    {
      "roll": "100",
      "description": "Your spell completely backfires creating a large explosion causing you to fall and bump your head.",
      "effect": "You hit yourself with your spell. If the spell effect is instant you take the full effect. If the spell requires concentration the effect persists until the end of your next turn. You also fall prone, take 1d6 bludgeoning damage, 1d6 thunder damage, and become unconscious for 1 minute or until you receive damage from any source.",
      "lore": "The archives of Stormwatch Keep record a similar blunder during the Great Summit."
    }
  ]
}